Revit 2024 API
GroupTypeId.ElectricalCircuiting Property
 Electrical - Circuiting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId ElectricalCircuiting { get; }
Visual Basic
Public Shared ReadOnly Property ElectricalCircuiting As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElectricalCircuiting {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace